package com.example.brainlevel;

public class Questionsworldwide {
        public String[] mQuestion = {
                "ม้าลายมีลายสีอะไร",
                "ยาสลบทำจากอะไร",
                "อาหารกระป๋องที่สมบูรณ์ เก็บไว้ได้นานเท่าไร",
                "แหล่งกำเนิดสุนัขไทยหลังอานอยู่ที่ไหน",
                "คติชาวบ้านเชื่อว่าปลาตัวใดจะช่วยคนเมื่อเรือแตก",
                "คนไทยรู้จักปลาทูน่าอีกชื่อหนึ่งว่าอะไร",
                "ไทยเรียกลมชนิดหนึ่งว่า \"ลมงวงช้าง\" คือลมอะไรในอเมริกา",
                "นกตัวใดเป็นสัญลักษณ์ของสหรัฐอเมริกา",
                "อุตสาหกรรมผลิตเบียร์ใช้ข้าวอะไร",
                "ตัวยา AZT และ DDI ใช้รักษาโรคอะไร",
                "ทองคำแท้มีกี่กะรัต",
                "เลขของโรมัน M เท่ากับจำนวนเลขอะไร",
                "โรคโลหิตจางเกิดจากการขาดสารอาหารอะไร",
                "ร่างกายของมนุษย์มีกระดูกกี่ชิ้น",
                "ประเทศใดผลิตทองแดงมากที่สุด",
                "ประเทศใดได้ชื่อจัดการกับขยะดีที่สุดในโลก",
                "ผักเก่าแก่ที่สุดที่มนุษย์เคยรู้จักคืออะไร",
                "ผลผลิตอะไรทำให้เวเนซุเอลารวยที่สุดในประเทศอเมริกาใต้",
                "นกตัวเล็กที่สุดในโลกคืออะไร",
                "เมืองหลวงของโปรตุเกสคืออะไร"

        };
        public String[][] mChoices ={
                {"ลายสีขาว","ลายสีดำ","ลายสีน้ำตาล","ลายสีดำ"},
                {"คลอโรฟิวส์","คลอโรฟอร์ม","โคลสลอว์","บีทานิน"},
                {"5 ปี","2 ปี","1 ปี","10 ปี"},
                {"ตรัง","สุโขทัย","พิจิตร","ตราด"},
                {"ปลาปักเป้า","ปลาดุก","ปลาโลมา","ปลาฉลาม"},
                {"ปลาทู","ปลาโอ","ปลาแซลม่อน","ปลาช่อน"},
                {"ทอร์นาโด","เฮอร์ริเคน","ใต้ฝุ่น","ไซโคลน"},
                {"นกกระจอกเทศ","นกอินทรีหัวขาว","เหยี่ยว","นกแก้ว"},
                {"ข้าวหอมมะลิ","ข้าวเหนียว","ข้าวบาร์เลย์,ข้าวมอลท์","ข้าวสวย"},
                {"ท้องร่วง","เหน็บชา","ความดัน","เอดส์"},
                {"1 กะรัต","36 กะรัต","24 กะรัต","28 กะรัต"},
                {"10,000","1,000","100,000","1,000,000"},
                {"เหล็ก","แคลเซียม","โซเดียม","โปรตีน"},
                {"216 ชิ้น","206 ชิ้น","256 ชิ้น","201 ชิ้น"},
                {"ไทย","อิตาลี","สหรัฐอเมริกา","จีน"},
                {"สเปน","อเมริกา","เยอรมัน","ญี่ปุ่น"},
                {"หัวหอม","ผักกาด","ถั่ว","ต้นหอม"},
                {"ทอง","น้ำมัน","เพชร","ทองแดง"},
                {"ฮัมมิ่งเบิร์ด","นกกระจอก","นกพิราบ","นกแก้ว"},
                {"นครชัยแอร์","นครลีสบัน","นครตาลีบัน","นครอัสตรา"}
        };
        public String[] mCorrectAnswer=
                {"ลายสีขาว","คลอโรฟอร์ม","1 ปี","ตราด","ปลาโลมา","ปลาโอ","ทอร์นาโด",
                        "นกอินทรีหัวขาว","ข้าวบาร์เลย์,ข้าวมอลท์","เอดส์","24 กะรัต","1,000","เหล็ก","206 ชิ้น","สหรัฐอเมริกา",
                        "ญี่ปุ่น","ถั่ว","น้ำมัน","ฮัมมิ่งเบิร์ด","นครลีสบัน"};
        public String getQuestion(int a){
            String question = mQuestion[a];
            return  question;
        }
        public String getChoice1(int a){
            String choice = mChoices[a][0];
            return  choice;
        }
        public String getChoice2(int a){
            String choice = mChoices[a][1];
            return  choice;
        }
        public String getChoice3(int a){
            String choice = mChoices[a][2];
            return  choice;
        }
        public String getChoice4(int a){
            String choice = mChoices[a][3];
            return  choice;
        }
        public String getCorrectAnswer(int a){
            String answer = mCorrectAnswer[a];
            return  answer;
        }



    }



